backend/controllers/MenuController.php

INSERT INTO `menu` (`name`, `route`, `order`, `icon`, `parent`, `data`) VALUES ('Import giá', '/product-item-pricelist/importprice', NULL, 'icon-user-follow', 29, NULL)
---
    public function actionCreate() {
        $model = new Menu;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `menu` WHERE `id`='55'
---
    protected function findModel($id) {
        if (($model = Menu::findOne($id)) !== null) {