backend/views/menu/_form.php

SELECT `name` FROM `menu`
---
<?php
AutocompleteAsset::register($this);

$options1 = Json::htmlEncode([
            'source' => Menu::find()->select(['name'])->column()
        ]);