backend/models/Menu.php

SELECT `name` FROM `menu`
---
    public function rules() {
        return [
            [['name'], 'required'],
            [['parent_name'], 'filterParent'],
            [['parent_name'], 'in',
                'range' => static::find()->select(['name'])->column(),

SELECT * FROM `menu` WHERE `name`='Quản lý sản phẩm'
---
    public function filterParent() {
        $value = $this->parent_name;
        $parent = self::findOne(['name' => $value]);