backend/models/User.php

    public static function getAllUser()
    {
        $users = User::find()->all();
---
SELECT * FROM `user`